УРВ_файловая/src/Documents/ИзменениеСостоянияСотрудника/ИзменениеСостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСостоянияСотрудника</name>
  <registerRecords>InformationRegister.ОкладыСотрудников</registerRecords>
  <registerRecords>InformationRegister.КадроваяИстория</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УРВ_файловая/src/Documents/ИзменениеСостоянияСотрудника/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ИзменениеСостоянияСотрудника.Ссылка,
	 |	ИзменениеСостоянияСотрудника.Номер,
	 |	ИзменениеСостоянияСотрудника.Дата,
	 |	ИзменениеСостоянияСотрудника.Проведен,
	 |	ИзменениеСостоянияСотрудника.Сотрудник,
	 |	ИзменениеСостоянияСотрудника.Подразделение,
	 |	ИзменениеСостоянияСотрудника.Регион,
	 |	ИзменениеСостоянияСотрудника.Должность,
	 |	ИзменениеСостоянияСотрудника.Статус,
	 |	ИзменениеСостоянияСотрудника.Оклад
	 |ПОМЕСТИТЬ втДокумент
	 |ИЗ
	 |	Документ.ИзменениеСостоянияСотрудника КАК ИзменениеСостоянияСотрудника
	 |ГДЕ
	 |	ИзменениеСостоянияСотрудника.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КадроваяИстория.Сотрудник КАК Сотрудник,
	 |	МАКСИМУМ(КадроваяИстория.Период) КАК Период
	 |ПОМЕСТИТЬ ВТ_МаксПоКадровым
	 |ИЗ
	 |	РегистрСведений.КадроваяИстория КАК КадроваяИстория
	 |ГДЕ
	 |	КадроваяИстория.Сотрудник = &Сотрудник
	 |	И КадроваяИстория.Регистратор <> &Ссылка
	 |	И КадроваяИстория.Период <= &Период
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	КадроваяИстория.Сотрудник
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	втДокумент.Дата КАК Период,
	 |	""КадроваяИстория"" КАК ИмяРегистра_,
	 |	втДокумент.Сотрудник КАК Сотрудник,
	 |	втДокумент.Подразделение КАК Подразделение,
	 |	втДокумент.Регион,
	 |	втДокумент.Должность КАК Должность,
	 |	втДокумент.Статус КАК Статус
	 |ИЗ
	 |	втДокумент КАК втДокумент
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	&период2,
	 |	""Кадроваяистория"",
	 |	ВТ_МаксПоКадровым.Сотрудник,
	 |	КадроваяИсторияСрезПоследних.Подразделение,
	 |	КадроваяИсторияСрезПоследних.Регион,
	 |	КадроваяИсторияСрезПоследних.Должность,
	 |	ЗНАЧЕНИЕ(Перечисление.СтатусыСотрудника.НеРаботает)
	 |ИЗ
	 |	ВТ_МаксПоКадровым КАК ВТ_МаксПоКадровым
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИстория.СрезПоследних КАК КадроваяИсторияСрезПоследних
	 |		ПО ВТ_МаксПоКадровым.Сотрудник = КадроваяИсторияСрезПоследних.Сотрудник
	 |			И ВТ_МаксПоКадровым.Период = КадроваяИсторияСрезПоследних.Период
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	""ОкладыСотрудников"" КАК ИмяРегистра_,
	 |	втДокумент.Сотрудник,
	 |	втДокумент.Оклад,
	 |	втДокумент.Дата КАК Период
	 |ИЗ
	 |	втДокумент КАК втДокумент
	 |ГДЕ
	 |	втДокумент.Оклад <> 0";
	 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	 Запрос.УстановитьПараметр("Сотрудник",ДокументСсылка.Сотрудник);
	 Запрос.УстановитьПараметр("Период",ДокументСсылка.Дата);
	 Запрос.УстановитьПараметр("Период2",ДокументСсылка.Дата - 60);
	 Результаты = Запрос.ВыполнитьПакет();
	 
	 ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
     ТаблицыДляДвижений.Вставить("ТаблицаОкладыСотрудников"			, Результаты[Результаты.Количество() - 1].Выгрузить());
     ТаблицыДляДвижений.Вставить("ТаблицаКадроваяИстория"			, Результаты[Результаты.Количество() - 2].Выгрузить());
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт	
	Если Ложь Тогда
		Объект = Документы.Рецепт.СоздатьДокумент();
	КонецЕсли;
КонецПроцедуры
